tutorials/forwardStep/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|U|e|T)"
    {
        solver		PCG;
        preconditioner  DIC;
        tolerance	1e-10;
        relTol		1e-5;
    }
    "(k|omega)"
    {
        solver		smoothSolver;
        smoother	GaussSeidel;
        tolerance	1e-10;
        relTol		1e-5;
    }
}
multiStage
{
    numberRungeKuttaStages 3;
    RKCoeff 1.0 0.25 0.66667;
}
cache
{
    grad(U);
    grad(p);
    grad(T);
    grad(e);
    grad(k);
    grad(rpsi);
}
// ************************************************************************* //
